Revit 2026 API

# RevitLinkOptionsSetWorksetConfiguration Method

---

Sets the set of worksets to open when creating the link.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetWorksetConfiguration(
	WorksetConfiguration config
)
```
```vb
Public Sub SetWorksetConfiguration (
	config As WorksetConfiguration
)
```
```cpp
public:
void SetWorksetConfiguration(
	WorksetConfiguration^ config
)
```
```fsharp
member SetWorksetConfiguration :
        config : WorksetConfiguration -> unit
```

#### Parameters

config WorksetConfiguration

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RevitLinkOptions Class

Autodesk.Revit.DB Namespace